# Part 1

The file "Purchase_Data.csv" contains purchase data at a Chinese supermarket for various products.  Read this csv into a dataframe called df_data and use the head() method to check that you have read in the data correctly. Make sure you import pandas.

In [1]:
import pandas as pd

df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Use the dtypes attribute to view how each column is stored

In [2]:
df_data.dtypes

invoice_number    float64
invoice_time       object
store_id           object
product_id          int64
category_id         int64
num_item          float64
price             float64
dtype: object

Slice the first two columns using .loc and store the result in a variable called result_1.

In [3]:
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

In [4]:
result_1 = df_data.loc[:, "invoice_number":"invoice_time"]
print(result_1)

      invoice_number   invoice_time
0       2.020000e+11  7/15/15 10:45
1       2.020000e+11  7/15/15 12:16
2       2.020000e+11  7/15/15 12:16
3       2.020000e+11  7/15/15 12:16
4       2.020000e+11  7/15/15 12:16
...              ...            ...
5377    2.020000e+11   9/5/15 23:07
5378    2.020000e+11   9/5/15 23:23
5379    2.020000e+11   9/5/15 23:24
5380    2.020000e+11   9/5/15 23:32
5381    2.020000e+11   9/5/15 23:38

[5382 rows x 2 columns]

Slice the first two rows using .loc and store the result in a variable called result_2.

In [5]:
result_2 = df_data.loc[0:1, :]
print(result_2)

   invoice_number   invoice_time store_id  product_id  category_id  num_item  \
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101       1.0
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203       1.0

   price
0    2.0
1    2.0

Slice the first four rows and the first five columns and store the result in a variable called result_3.

In [6]:
result_3 = df_data.loc[0:3, "invoice_number":"category_id"]
print(result_3)

   invoice_number   invoice_time store_id  product_id  category_id
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203
2    2.020000e+11  7/15/15 12:16     G816     7070884        70203
3    2.020000e+11  7/15/15 12:16     G816     7070891        70401

Slice rows 0,4,6 and columns invoice time and price and store the result in variable called result_4.

In [7]:
result_4 = df_data.loc[[0,4,6], ["invoice_time", "price"]]
print(result_4)

    invoice_time  price
0  7/15/15 10:45    2.0
4  7/15/15 12:16    6.0
6  7/15/15 15:28    2.0

Store the number rows in a variable called num_rows.

In [8]:
num_rows = len(df_data.index)
print(num_rows)

5382

Print out the last row of the data to dataframe. **Hint:** use the variable num_rows from the previous exercise.

In [9]:
print(df_data.loc[num_rows-1])

invoice_number    202000000000.0
invoice_time        9/5/15 23:38
store_id                    G619
product_id              23030206
category_id               210101
num_item                     1.0
price                        2.0
Name: 5381, dtype: object

# Part 2

In [10]:
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Compute the average and max price charged.  Store the results in variables called avg_price and max_price

In [11]:
avg_price = df_data["price"].mean()
avg_price

3.1920522110741363

In [12]:
max_price = df_data["price"].max()
max_price

6.01

Compute the average price and average number of items purchased with only a single call to the mean() method. Store these averages in avg_price and avg_num_items.

In [13]:
avg_price, avg_num_items = df_data[["price","num_item"]].mean()
print("Average Price:", avg_price)
print("Average Number of Items:", avg_num_items)

Average Price: 3.1920522110741363
Average Number of Items: 1.2983091787439613

Create a column called "total", which is the product of the price and num_item columns.

In [14]:
df_data["total"] = df_data["price"]*df_data["num_item"]
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,total
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0,6.0

What is the avgerage price of the three most expensive purchases?

In [15]:
df_sorted_total = df_data.sort_values(by = ["total"], inplace =False, ascending=False).head(3)
df_sorted_total

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,total
4510,2.020000e+11,8/30/15 20:21,628,21000362,210301,116.0,3.0,348.0
3784,2.020000e+11,8/26/15 17:12,6666,7000294,210101,48.0,1.5,72.0
4288,2.020000e+11,8/29/15 8:31,6666,7000294,210101,48.0,1.5,72.0

In [16]:
df_sorted_total["total"].mean()

164.0

How many different products are there?

In [17]:
number_products = df_data["product_id"].value_counts().sum()
number_products

5382

Find the difference between the mean and median of the column total.  Use the describe() method and then index the dataframe it returns.

In [18]:
summary = df_data["total"].describe()
summary

count    5382.000000
mean        3.931808
std         5.820520
min         0.000000
25%         2.000000
50%         3.000000
75%         5.000000
max       348.000000
Name: total, dtype: float64

In [19]:
difference_mean_median = summary["mean"]-summary["50%"]
print("Difference between the mean and median of the column total is", difference_mean_median)

Difference between the mean and median of the column total is 0.9318078781127839

Use the drop() method to delete the column total from the dataframe df_data.

In [20]:
df_data.drop(["total"], inplace = True, axis=1)
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Let's dig a little deeper into the data set and answer some basic question.

In [21]:
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

First, covert the column invoice time to a datetime column. Print out the new column types to make sure this was done correctly

In [23]:
df_data["invoice_time"] = pd.to_datetime(df_data["invoice_time"]) 
df_data.dtypes

invoice_number           float64
invoice_time      datetime64[ns]
store_id                  object
product_id                 int64
category_id                int64
num_item                 float64
price                    float64
dtype: object

Next, let's create columns called "DOW" and "Month", which store the corresponding weekday and month of the invoice respectively.  Print the head of the dataframe to make sure this was done correctly.

In [24]:
df_data["DOW"] = df_data["invoice_time"].dt.day_name()
df_data["Month"] = df_data["invoice_time"].dt.month_name()
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,DOW,Month
0,2.020000e+11,2015-07-15 10:45:00,G816,7000300,210101,1.0,2.0,Wednesday,July
1,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,Wednesday,July
2,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,Wednesday,July
3,2.020000e+11,2015-07-15 12:16:00,G816,7070891,70401,1.0,6.0,Wednesday,July
4,2.020000e+11,2015-07-15 12:16:00,G816,7090363,70401,1.0,6.0,Wednesday,July

Create a variable called num_purchases_wed, which stores the number of purchases made on Wednesday?  You should use value_counts and then index the series it return.

In [25]:
num_purchases_wed = df_data["DOW"].value_counts()["Wednesday"]
num_purchases_wed

959

# Part 3

In this set of practice exercises, we will be working with a demographic data regarding the passengers aboard the Titanic.  Read in the data frame and use the head() method to check that it was read in correctly.

In [27]:
df_titanic = pd.read_csv("Titanic.csv", header=0)
df_titanic.head()

<class 'NameError'>: name 'pd' is not defined

Use the rename method to change the column "Name" to "Passenger_Name" and the column "Ticket" to "Ticket_Num".

In [28]:
df_titanic.rename(columns={"Name":"Passenger_Name"}, inplace=True)
df_titanic.head()

<class 'NameError'>: name 'df_titanic' is not defined

Change the index of the df_titanic to the column PasengerID.

In [29]:
df_titanic.set_index("PassengerId", inplace = True)
df_titanic.head()

<class 'NameError'>: name 'df_titanic' is not defined

Select the name of passenger 896

In [30]:
passenger_name = df_titanic.loc[896, 'Passenger_Name']
print("Name of passenger 896:", passenger_name)

<class 'NameError'>: name 'df_titanic' is not defined

Change the index back to row numbers but making sure that we don't lose the PassengerId column.

In [31]:
df_titanic.reset_index(drop=False, inplace=True)
df_titanic.head()

<class 'NameError'>: name 'df_titanic' is not defined

How many missing entries are there in the Age column? Use the isnull() method and recall than Booleans are exactly like 1s (True) and 0s (False).

In [32]:
missing_age = df_titanic['Age'].isnull().sum()
missing_age

<class 'NameError'>: name 'df_titanic' is not defined

Compute the avg age of passengers ignoring the missing data.

In [33]:
avg_age = df_titanic['Age'].dropna().mean()
avg_age

<class 'NameError'>: name 'df_titanic' is not defined

Using the fillna() method replace the missing values in the Age column with the mean.

In [34]:
df_titanic.fillna(avg_age)

<class 'NameError'>: name 'df_titanic' is not defined

What is the average age of the 5 oldest passengers? The reset_index method will be helpful here.

In [35]:
get_oldest = df_titanic.sort_values(by='Age', ascending=False).head(5)
get_oldest

<class 'NameError'>: name 'df_titanic' is not defined

In [36]:
avg_oldest = get_oldest['Age'].mean()
avg_oldest

<class 'NameError'>: name 'get_oldest' is not defined